CheckinPortalCloudAPI/request2.txt

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://webservices.micros.com/ows/5.1/Name.wsdl#FetchProfile</Action>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>HA5D3-KSK</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">FairmontsingaporeITADMIN000.</wsse:Password>
      </wsse:UsernameToken>
      <wsu:Timestamp>
        <wsu:Created>2023-12-13T11:00:15Z</wsu:Created>
        <wsu:Expires>2023-12-13T11:05:15Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
    <OGHeader transactionID="31062759" timeStamp="2023-12-13T11:00:15" xmlns="http://webservices.micros.com/og/4.3/Core/">
      <Origin entityID="KIOSK" systemType="KIOSK" />
      <Destination entityID="KIOSK" systemType="PMS" />
      <Authentication>
        <UserCredentials>
          <UserName>HA5D3-KSK</UserName>
          <UserPassword>FairmontsingaporeITADMIN000.</UserPassword>
          <Domain>HA5D3</Domain>
        </UserCredentials>
      </Authentication>
    </OGHeader>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <FetchProfileRequest xmlns="http://webservices.micros.com/ows/5.1/Name.wsdl">
      <NameID type="INTERNAL">1580385</NameID>
    </FetchProfileRequest>
  </s:Body>
</s:Envelope>